//Написать программу, которая на вход
//принимает число и выдает его квадрат
//(число умножкнное на само себя).
// Пример  4->16
Console.Write("Insert the number: ");
int number = Convert.ToInt32 (Console.ReadLine());
Console.WriteLine($"square number  { number } = {number*number}");